tutorials/immersedBoundary/refiningMovingCylinderInChannelTurbulent/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5e-4;

boundaryField
{
    ibCylinder
    {
        type            immersedBoundaryKqRWallFunction;
        patchType       immersedBoundary;
        setDeadValue    yes;
        deadValue       1.5e-4;
        value           uniform 1.5e-4;
    }
    top
    {
        type            zeroGradient;
    }
    in
    {
        type            fixedValue;
        value           uniform 1.5e-4;
    }
    out
    {
        type            inletOutlet;
        inletValue      uniform 1.5e-4;
        value           uniform 1.5e-4;
    }
    bottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
