tutorials/immersedBoundary/refiningMovingCylinderInChannelTurbulent/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DebugSwitches
{
    // immersedBoundary 1;
    // polyMesh 2;
    // fvMesh   2;
}

application     pimpleDyMIbFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.02;

// writeControl    runTime;
// writeInterval   0.2;

writeControl    timeStep;
writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

libs
(
    "libimmersedBoundary.so"
    "libimmersedBoundaryDynamicMesh.so"
    "libincompressibleImmersedBoundaryTurbulence.so"
);

functions
(
    forces
    {
        type               forces;
        functionObjectLibs ("libforces.so");

        outputControl timeStep;
        outputInterval 1;
        patches ( ibCylinder );

        pName       p;
        UName       U;
        rhoName     rhoInf;
        rhoInf      1;

        log         true;
        CofR        ( 0 0 0 );

        Aref 0.05;
        Uref 1;
    }
    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        outputControl   timeStep;
        outputInterval  1;
        probeLocations
        (
            ( 1.5 0 0)
            ( 1.75 0 0)
        );
        fields
        (
            p
        );
    }
    minMaxP
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name p;
    }
    minMaxU
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name U;
    }
    minMaxNut
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name nut;
    }
    minMaxK
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name k;
    }
    minMaxNut
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name epsilon;
    }
);


// ************************************************************************* //
